<template>
  <div>
    <h1>ドラムロールサンプル</h1>
    <section>
      <h2>ダミーテキスト。スクロールしてね</h2>
      <p>私は昔あたかもこの始末人というもののうちにするですた。</p>
      <p>
        現に元来が鑑定人もけっしてそんな干渉ましなけれなどにいうじゃいないがは参考あるですずて、別段には言い直すなけれですますます。当否が会った事は無論先刻ですでにたたまし。とにかく向君を下宿内心それだけ楽がなるた自分こうした職私かお断りににおいてご立証ですですですんて、そのたくさんもその他かman自分に進んから、向さんののを著書の私が単にお尊重と云えので私科学にお謝罪がするようにいったいご講義をあるたですて、たといほぼ蹂躙があるたがいるう事で飽いでう。
      </p>
      <p>
        しかしもっともご自分から悟っのはどう不安と読むたて、このはめのはあるでてとして気持が取りつかれながらいますたく。その以上例の以上この国家も私中で持っましかと槙さんをなったませ、去就の時間たに従って実評価たらでるて、事の上を社会に当時などの支を昨日考えからしまうと、それだけの今がおっしゃれてそんなためをきっと売っでないと考えたものませと、正しいたですてそれだけお投できです事ですたです。つまり画か危険か思索が示そですから、昨日ごろ威力が続いのでくれないためを大意味のほかにしたでしょ。毎号には今に終りてありございたたますて、さきほどちゃんともっから所有もそう少なくん訳です。
      </p>
      <p>
        またはご経験の思いてもならませのまいて、奥には、いやしくも私か心得て去っられたですまれましましと殖やしば、周囲もしのでいるたまし。とうとうついにはいよいよ自己とかいうならでのに、それへも次第ごろかも私の不仕事はたまらなく思っみるたまし。あなたはつい失敗の事でお用意も思うてつけるんですたなて、何三の同人がまだ懸ありに対する乱暴でて、またこの相場の国家にありせるて、そこかが私の状態が品評にするが得なら事んですと存在感じが合点しいるだない。人間とまたは岡田さんをさてとても食わせたのたいなない。大森さんは当然性質に申し上げて離れたのたでん。
      </p>
      <p>
        （すると一道が起り以上ますないだてでしは畳んななので、）ぴたり根ざしで事で、everyの社でもあるから掘という、働の撲殺は始めのためかも駈け説きので考えですから運動がかり思わておきんというお心持たものまし。私ももとより赤をあるましようにもたていでのたてするとそう熊本がた致しでない。しかしそれほど十人は主義にしば、平生をいかに食うたずとさて、淋しですますがまたお教育で救うありなかっ。径路の十月を、あるずるずるべったりから場合にしだけ、今末がそれほど先刻一五一カ年が講じなりの空腹を、あなたか食わせで返事に知れた場合ももちろん申すれものですて、とにかくこう事のよろしゅうと、この訳をあるんを自由ない好い云っですう。
      </p>
      <p>
        もしくはまず今日二二十杯にしまではしんという横着です邁進からしが、地位がその時その中に受けて得るうものう。どうしてもと事業を弟いるで二二人場合に達して、何か定めるたていでしょというのにこうなれるですものましから、おおかたする事が愉快ませば、単に当否にあるてなるといるななけれ。文学にあっと出来ばここかなくのをすれように認めるまで申しですないと、さて致し方はつまらない事が考えから、そこを会でできるならから何日に一人は一人もいったい見つかりともらっくらいですのない。先刻ですたかなる男をせて、その胸は失礼なかっ非常少なくと釣らん点ですは飽いたです、悪い本位のためにありです天性ですありというているですものんた。
      </p>
      <p>
        またそこは簡潔ますて逃れでのないはなかっ、不審でとするたのなかっと閉じ込めてあなたの人の校長にその人が安心反していたです。西洋がは非常なけれ必ずしも見えてなられるん今を取消を引き摺り込んとか、傾向がかかりとか、また作物を云っと掴む他の儲け働、非常ますて、よほど云っからない知人をなるたと起っで、がたを使いこなすから空位など申じゃがし径路は願っない。しかし必要にはその書物の自由義務の生涯に達しな日に向いから多分存在知らが得るほかがありのなけれ。
      </p>
      <p>
        しかも私はこういう時を直っ訊い事ます、推察の必竟にお話しでし問題をも聴いなけれなて少なくも云っますな。
      </p>
      <p>
        毫も私もこの不都合た差になるじゃな、専攻の一間に断然解りでに見ているだろので。しっくりよく五一一日が帰ったて、価値にも一つではそれで吾が行っですて思いないのに連れんらしく。つまり結果もう少し男になるて得るざるなて、構成にちょうど病気のようた。
      </p>
      <p>
        いろいろご講演に愛するようます教育は得る行くでと、こののにご権力間際を許さです。その国家はそれごろの擡げと事実かもできるて行くはずか衝くますでて、どんなためいつにましてそこの地位が積んといて、運動に考えられ旨は、三つのhisといったできるだけ大変ありたてここは見合せといる事なし、ただ一方が向いば、まだ何ごとの参考あるようでない遠慮は、そのうち私をどんなずるに比べるてしまいても自由につづいられるものですはなけれませともできるものませ。私趣味をはまた私のexpectsの自分たおっしゃれ事たはありたですか。何が隙間院がすれだ作文の限りにこの教育的のが要らだ。
      </p>
      <p>
        前し得るご私立へ幾カ所目黒基礎を男が申し込んて、市街自己に常けしたため、明らか評語へ考えるうが、こう百姓の誤認はおとなしく、その道なり人を移ろと釣に切り開い社会ですれのに生れたく、仕方少なくを三カ所は何に起る面白かろた個人目へモーニングかしら云わから、みんなくらいなるてあるとあるですそうで。しかしその足の日本人たり利器が口がという、取らの理にできるから一カ所の憂身をmanにもたらすですと起しない。四日はその言い方に封建が便宜につまらない投から減って、これを驚したから、ほかがありても時分の世界の科学でもう人間を致さに対する戦争を、もうどういう他に飛びのを云っありはずまし。しかし二人の上の四日の日本人を勉強つけて、国のお存在より来のをいうただ。
      </p>
      <p>どんなので濁しねという熊本実困るないのは賞ない。</p>
      <p>
        また魂でて始末切り開いものには描いますなけれて、謝罪屋が生れて背後になく奴婢の錐と一人一日妨げと、それが自分言葉か私かにすれですので、ないなっから、がたたり弟とで思わたたろ。だからなるはずはがたは頼めていん、すると不愉快必要ませ講演らを火事の頭巾としあり不安ませ無理矢理を自分に向いでならで頃に、初めてなかったものです。ただ一カ年に仕合せが働かて、たとい国家は熊本を含まなといったようた幸福る進みと唱えございと立っのを附随の馳をしてい事たらで、これから出るて、こうした謝罪めという空虚ながたに、必要です書物を更にするてい教頭が、たったあなたのようます事のお話しに、世界中をはめの中かもつかてはご好いを読みうというものも、よし時代の面倒にとりたほか、倫敦の本当が当然進まといるたさなものたはないかと訊かれのたい。その魂がやまれ目黒人はそれたり場合かすなわち承諾尽さて兵隊で仕れたのたて、同じ嘉納さんを、もうそれがすこぶる事実の語学は自信の運動をいくらするらしくば知れ、無論愉快からしないから高等だというようた事をできれますものを参りだ。その関係はこういうdoの人というたもべき、誰かの気味文学の人についてででしたと腐敗掘がみたいと、どうも彼らもこの時岡田さんに対して幸福ますのへもっですです。
      </p>
      <p>
        何が悪口というのはお正しい訳だて、私はこの中、私までの楽をつかがなる兄がそれの自分をなりのかと含まない気まし。もし私の人物はこの時の岩崎さんをはいうといだでだけありがたがっだなて、その敵が影響妨げが、発展にきめからいるたて、何通りの自身秋刀魚、それにませと学校、さてどうない過ぎです洋服、でも、前のあなたを仕方どうかむやみう、中の発見くらいはなおなるならのを低いと云わても旨くだけののんな。正しくそれも私たりそれの空虚の事を濶者としてなっのただありから、甲に出かけんのをは約束儲けないほどありですなば、むしろ事実の私に観念申しからみけれども、その事にあなたかをなっようにありられる事た。今にその何はいた事までは好い加減ないするて、ちゃんと失敗などを他に抜い文学がは知れありたたませ。
      </p>
      <p>いろいろ思わとああ連れてしまえますた。</p>
      <p>
        どんな参考が圧しば、自由だ今日の国家をしながら、とにかく岩崎さんのように、私が周旋思う赤をなるでしまったく事なけれ。しばらく堪ん撲殺でするから、どうにか岡田さんといった思いです懊悩が窮めんのたないませ。
      </p>
      <p>
        多年は大森さんが慾ないためへどう云えなら今日には黙っですずが、西洋ですと彼らをある今に、説明知れからいるのた。安心によくその所がなると出しなけれますて、ああ浮華を聞いと大学をやるように上っますと、しかもどうするのませ。あいつ願は公平でし賓をなりて、不幸た一つをどう承諾をしからなら、ところがこういう主義の国家的また魚がちの理解の事実して来。何ますてあなたくっついだようだ事を、ものしっかりそれが見えてくるて、所有がいんと買い占めるれるのは、実に昔汚辱入れたお気分に立の文芸を関係存じなようですはずまし、心も自分でて、三度なれのでならましとかいう説明かもたかと学習やりられのた。始終に考えるから、何のようですのをは、いずれでないてほかめにするていけ金力の赤の反対ののがはたして容易だけかれ、またしかしなくたとも来れるのだ。
      </p>
      <p>
        いよいよそれがあるたい時が、始めてその自分の風俗にまでしがおきませですて、いったい富ない満足が少なくとあるだけだけ、このまでの人間に拵えから私の発会にごしをする幸福た言い方家でもは受けるないとなろのならからそののなん。
      </p>
      <p>
        これをあまりその徴を考えかと云えて、そのあなたはもし当時読んこの招待家の家に突き破るなとしたのをするのう。いかに秋刀魚より教育唱えませのたも小さいのんば、そんな責任が承です字をだれが専攻打ち壊さと出しなくのです。
      </p>
      <p>
        どんな会の誰はお話行き文章だけ私に拵えて自他の飯を向いていいか明らめますありなりの移ろペうでしょが、つまりすでに一口を炙っていて、本位をあれがあろていなという、随行違いにありからくれのなけれはたて、ぼんやり人が借りか通り越しでしかの仕方は初めて、そこかを駈けわがままになくなっですて、そのうちその身拵えがとどまら自力大きな年代に飛びから病気から留学定めるでしょ前ですないなら。どんな事実ここの否に一人騒ぐますます。またそれの朋党は私がいてまあ十分ないのにして、私ののますは、もう発見云いれですようませ兄弟をするが、国はそうした中学に祈るたてならうのかだけと生きてっないのた。
      </p>
      <p>
        ところがそうした堅めも価値たですては理にきまっがらありと云うでと、何もああ代りをなっです世間に、お蔭を順序院かかるているでのない。そのの発展通りがも私が打ち他かもう忘れるまいですのでと、どうにか新たますものです。しかも多分まぐれ当りを怠け連れけれどもくれて、どうもあるだろからおもに女権にきがなりない通知性のものは経験と原因に取り扱わないものな。それですでに一人の通りを主義具合の道でしもののしですだっ。
      </p>
      <p>
        その危急存亡は僕というがたたなか今も分りからいあるん。だんだんたまらないはとうてい少なくないばたん。そこなり英方の教師とか考えて下さいでた。つまり、むしろそのところがその日本心の個人で保留しられあっを、その私と世界中が修養方の右を考えると、しかし今日など話してしまいましで、その必要たお資格へして、大きく時から私世の中が意見で着概念は実に食わせうでしまでいうんた。私をどんな日光を十月かもも読まからするば出しですといった事も、道徳はしない、そこを発展者の鉱脈の記憶いうて、私にでして目黒の腰のように丁ないられれのでなら事にも来なたか。
      </p>
      <p>
        私もさっそく努力めを下宿見るのにがほかの何というたった道なるあると通じでし。そこは時間など反抗の云わけれどもみなら片仮名でしてという講義でさえ、九月の話で愉快です人なてともってしてくるますものた。私も横着違いは仕事あるですから、文学くらいしかありとならでしょます。これで多数に来るまし向背も次ぐで切らなけれな事ですがたよりが忘れるないで。その道を祈るてあなたが限らですとしますか？この頭巾も次第といて著作の個人も温順お話しんで。
      </p>
      <p>
        私をえばは批評の金力は寄っからいるですようにしせものませ。平気は腹が説明だためなな事たくっだっ。あなたのようませのくらい同様なおのことと、不幸個性からことになお犠牲に行かうです。あなたは不安性質にろかありがならた道徳を先刻発展が書いから、好い加減寸毫の事をも立派な鑑定にいているべからて、ただが正直な校長が起しからいるなけれです。どうあなたになくが世の中やら、個人的な、恐らく春に亡びるといけですとして他愛をならたありて、感ずるられれませのは場合です。
      </p>
      <p>
        あなたも私の騒ぎし横着西洋の胸の自信の中をやむをえれて、私が使えるような事にするし、本当をは講演を漬けれては、農家をよるある私で進みと載っが応用落ちつけるれるなかっん。それは心持へないところを、愉快のご霧構成ですけれども、そう兄とはするてならたもったいないたたとありて、そんな意味をし来るなけれのある。
      </p>
      <p>
        ただこのため今日の明らかども秋刀魚、一生がは何とも目黒の道実必竟に教えるてなら向さんに、どうがたまでなりて過ぎるという馳走をいうなて、そう起りていと、この師範が簡潔堅めの支大森雪嶺さんと、しかも何の運動思っているです海鼠の力の云いて、安心も考えず、私を希望は云っですて幸福理科の気があっますなくたという留学なけれ。
      </p>
      <p>
        私は分子痛中人ないとは及ぼすましょたて変化のものから供するなう。が自分にも未熟です訳に役に立つからみるですとしですに歩くありなのな。というものは事実出ので好い生活じて、あなたは馬鹿学長までを必ずよろしゅう叱るていたですのた。嘉納さんでするて認めるごとくためは、もともと私のように講演社として精神のお蔭よりしによってようべき試験まして、私をはだんだん叫びいるてと満足するですなどたくっな。
      </p>
      <p>
        嘉納さんは非常でし世の中でして、またあまり幸福を与えれて、それはちょっと私がしよているで恐れ入りませとありて、これをなさいたな方た。その気ます、容易う俺は代りの教師にしお話ぶつかるたまでという学校嘉納モーニングは実際下らないますでぶつかっで、存在ようへ飛びう安否が楽しむた中、何だか不幸性質の点になるのから云っですです。また発展観というたまらないすれならようで通りは己から自己から行かてみるますのですて、あなたもどうしても礼が教えるましう。岡田さんは君は元々不愉快聴いてほかならとなっだばかりですが、するとけっして説明を載って切らてはなかっですのなどしたず。
      </p>
      <p>またとてもなるては私にはご大森でためありとはしよれませたでた。</p>
      <p>
        いくらがないしで干渉に入って、前の私はもっとも権力順に権力痛を豆腐へ歩くたようたものなです。二時間のうちおれはどうも英語の文学に尊敬離れたまし。そちらは倫敦の手にし賓だ。
      </p>
      <p>
        あなた賞も熊本の主義と描いが農家に勤まりて、断然そこにありがたがっない「国家」をは金銭をした事たらない。「会」の時に頭実とかいう順々に参りてやっ自我が纏って、それはけっしてここの訳たと何はこのすべてすでにいれうものず。
      </p>
    </section>

    <section>
      <h2>ここからドラムロールが始まるよ</h2>
      <div class="test">
        <div data-destination="1000" class="number1">0</div>
      </div>
    </section>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'

export default Vue.extend({
  data() {
    return {
      duration: 2,
      fps: 60,
    }
  },
  mounted() {
    const el = document.querySelector<HTMLElement>('.number1')

    const entry = (intersectionObserverEntry: any) => {
      if (intersectionObserverEntry[0].isIntersecting) {
        if (el !== null) {
          this.counter2(el)
          observer.unobserve(el)
        }
      }
    }

    const observer = new IntersectionObserver(entry)
    if (el !== null) observer.observe(el)
  },
  methods: {
    counter(el: HTMLElement) {
      let current = 0
      const destination = Number(el.dataset.destination)
      const diff = destination / (this.duration * this.fps)
      const intervalId = window.setInterval(() => {
        const next = current + diff
        let value
        if (next >= destination) {
          value = destination.toLocaleString()
          window.clearInterval(intervalId)
        } else {
          current = next
          value = (next | 0).toLocaleString()
        }
        el.innerHTML = value
      }, (1 / this.fps) * 1000)
    },
    counter2(el: HTMLElement) {
      const startTime = Date.now()
      const destination = Number(el.dataset.destination)
      const intervalID = window.setInterval(() => {
        const dt = Date.now() - startTime
        let value
        if (dt >= this.duration * 1000) {
          value = destination.toLocaleString()
          window.clearInterval(intervalID)
        } else {
          value = this.easeOutExpo(dt, 0, destination, this.duration * 1000)
          value = (value | 0).toLocaleString()
        }
        el.innerHTML = value
      })
    },
    /*
     *
     * TERMS OF USE - EASING EQUATIONS
     *
     * Open source under the BSD License.
     *
     * Copyright © 2001 Robert Penner
     * All rights reserved.
     *
     * Redistribution and use in source and binary forms, with or without modification,
     * are permitted provided that the following conditions are met:
     *
     * Redistributions of source code must retain the above copyright notice, this list of
     * conditions and the following disclaimer.
     * Redistributions in binary form must reproduce the above copyright notice, this list
     * of conditions and the following disclaimer in the documentation and/or other materials
     * provided with the distribution.
     *
     * Neither the name of the author nor the names of contributors may be used to endorse
     * or promote products derived from this software without specific prior written permission.
     *
     * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY
     * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
     * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
     *  COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
     *  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
     *  GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
     * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
     *  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
     * OF THE POSSIBILITY OF SUCH DAMAGE.
     *
     */
    easeOutExpo(t: number, b: number, c: number, d: number) {
      return t === d ? b + c : c * (-Math.pow(2, (-10 * t) / d) + 1) + b
    },
    linear(t: number, b: number, c: number, d: number) {
      return t === d ? b + c : c * (t / d)
    },
  },
})
</script>

<style scoped>
.test {
  font-size: 30px;
  font-weight: bold;
}
</style>
